ekrats/SC0X_Monitor/bsp/stm32f40x/userApp/canApp.cpp
#include "canApp.h"
#include "canTask.h"
#include "stm32f4xx.h"
#include <rtthread.h>
#include "string.h"
#include "can.h"
#include "can_app_def.h"
#include "ScManagerExtern.h"
#include "ScManager.h"
#include "DataStruct.h"
extern CanApp can;

/****************************************************************
* Description    : STD CAN数据帧 配置表
*****************************************************************/
static STD_MSG_CON_TB _std_msg_table[CAN_STD_FRAME_NUM] = 
{ 
	/*port     type          dest         src       func                  len    clock,   tick  update   candata               appdata  */
	{PORT1, CAN_TX_DIRC, CAN_ID_Cx,    CAN_ID_M1,  CAN_FUNC_CHARGE, 	8,     0,	   20,    0, 	(uint8_t *)&can.CanBuf.ChargeCmd,    (uint8_t *)&can.sCan.canAppBuf.ChargeCmd,    	RT_NULL},
	{PORT1, CAN_TX_DIRC, CAN_ID_C0,    CAN_ID_M1,  CAN_FUNC_S_POLL,     8,     0,	   20,    0, 	can.CanBuf.null,    (uint8_t *)&can.sCan.canAppBuf.null,    			RT_NULL},
	{PORT1, CAN_TX_DIRC, CAN_ID_C0,    CAN_ID_M1,  CAN_FUNC_P_POLL, 	8,     0,	   1000,   0, 	can.CanBuf.null,   (uint8_t *)&can.sCan.canAppBuf.null,    			RT_NULL},
	
	{PORT1, CAN_ZX_DIRC, CAN_ID_C0,    CAN_ID_M1,  CAN_FUNC_IAP_CHECK,   8,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.iap_check,   (uint8_t *)&can.sCan.canAppBuf.iap_check,    	RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C0,    CAN_ID_M1,  CAN_FUNC_IAP_INFO,  0x10,   0,	   0,      0, 	(uint8_t *)&can.CanBuf.iap_info,   (uint8_t *)&can.sCan.canAppBuf.iap_info,    	RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C0,    CAN_ID_M1,  CAN_FUNC_IAP_WRITE, 0xfd,   0,	   0,      0, 	(uint8_t *)&can.CanBuf.iap_file,   (uint8_t *)&can.sCan.canAppBuf.iap_file,    	RT_NULL},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,  CAN_ID_C0,  CAN_FUNC_IAP,   		8,     0,	   0,      0, 	(uint8_t *)&can.CanBuf.iap_reply,   (uint8_t *)&can.sCan.canAppBuf.iap_reply,    	can.MsgRx_Deal},
	
	{PORT1, CAN_ZX_DIRC, CAN_ID_C1,    CAN_ID_M1,  CAN_FUNC_SET_PARA,   24,     0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb1WPara,   (uint8_t *)&can.sCan.Cb1WPara,    	RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C2,    CAN_ID_M1,  CAN_FUNC_SET_PARA,   24,     0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb2WPara,   (uint8_t *)&can.sCan.Cb2WPara,    	RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C3,    CAN_ID_M1,  CAN_FUNC_SET_PARA,   24,     0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb3WPara,   (uint8_t *)&can.sCan.Cb3WPara,    	RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C4,    CAN_ID_M1,  CAN_FUNC_SET_PARA,   24,     0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb4WPara,   (uint8_t *)&can.sCan.Cb4WPara,    	RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C5,    CAN_ID_M1,  CAN_FUNC_SET_PARA,   24,     0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb5WPara,   (uint8_t *)&can.sCan.Cb5WPara,    	RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_Cx,    CAN_ID_M1,  CAN_FUNC_CHARGE,    8,     0,	   0,      0, 	(uint8_t *)&can.CanBuf.ChargeCmd,   (uint8_t *)&can.sCan.canAppBuf.ChargeCmd,    	RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C1,    CAN_ID_M1,  CAN_FUNC_P_POLL,	   8,    0,	   0,      0, 	can.CanBuf.null,   (uint8_t *)&can.sCan.canAppBuf.null,    		RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C2,    CAN_ID_M1,  CAN_FUNC_P_POLL,	   8,    0,	   0,      0, 	can.CanBuf.null,   (uint8_t *)&can.sCan.canAppBuf.null,    		RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C3,    CAN_ID_M1,  CAN_FUNC_P_POLL,	   8,    0,	   0,      0, 	can.CanBuf.null,   (uint8_t *)&can.sCan.canAppBuf.null,    		RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C4,    CAN_ID_M1,  CAN_FUNC_P_POLL,	   8,    0,	   0,      0, 	can.CanBuf.null,   (uint8_t *)&can.sCan.canAppBuf.null,    		RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_C5,    CAN_ID_M1,  CAN_FUNC_P_POLL,	   8,    0,	   0,      0, 	can.CanBuf.null,   (uint8_t *)&can.sCan.canAppBuf.null,    		RT_NULL},
	{PORT1, CAN_ZX_DIRC, CAN_ID_Cx,    CAN_ID_M1,  CAN_FUNC_REBOOT,	   8,     0,	   0,      0, 	can.CanBuf.reBoot,   (uint8_t *)&can.sCan.canAppBuf.reBoot,    		RT_NULL},
	
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C1,  CAN_FUNC_S_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb1Status,   (uint8_t *)&can.sCan.cb1Status,    	can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C2,  CAN_FUNC_S_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb2Status,   (uint8_t *)&can.sCan.cb2Status,    	can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C3,  CAN_FUNC_S_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb3Status,   (uint8_t *)&can.sCan.cb3Status,    	can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C4,  CAN_FUNC_S_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb4Status,   (uint8_t *)&can.sCan.cb4Status,    	can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C5,  CAN_FUNC_S_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb5Status,   (uint8_t *)&can.sCan.cb5Status,    	can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C1,  CAN_FUNC_P_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb1Para,   (uint8_t *)&can.sCan.Cb1Para,    		can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C2,  CAN_FUNC_P_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb2Para,   (uint8_t *)&can.sCan.Cb2Para,    		can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C3,  CAN_FUNC_P_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb3Para,   (uint8_t *)&can.sCan.Cb3Para,    		can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C4,  CAN_FUNC_P_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb4Para,   (uint8_t *)&can.sCan.Cb4Para,    		can.MsgRx_Deal},
	{PORT1, CAN_RX_DIRC, CAN_ID_M1CX,    CAN_ID_C5,  CAN_FUNC_P_POLL,    24,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.Cb5Para,   (uint8_t *)&can.sCan.Cb5Para,    		can.MsgRx_Deal},
		
	{PORT2, CAN_RX_DIRC, CAN_ID_M1,      CAN_ID_AD,  CAN_FUNC_AD_POLL,   16,    0,	   0,      0, 	(uint8_t *)&can.CanBuf.AD_RxChnn,   (uint8_t *)&can.sCan.canAppBuf.AD_RxChnn,    		can.MsgRx_Deal},	
		
};

//static __IO STD_MSG_CON_TB *_std_msg = _std_msg_table;

CanApp::CanApp(ScData & scCan):sCan(scCan)                                                                                                                                                   
{
	_std_msg = _std_msg_table;
	
	CanStateWord = 0x000F;
	
	canOffTime = 200;
	
