ekrats/SC0X_Monitor/bsp/stm32f40x/userApp/canApp.cpp
}

/****************************************************************
* Function Name  : StdMsgRx_Common_cb
* Description    : 接收控制板状态数据处理 
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::MsgRx_Deal(CAN_RX_DATA_RAM* _p, EXTID_UTYP* _tRecId, uint8_t frame)
{
	static uint16_t DataLen = 0;
	//------------------------------------------------------------------
	// 收到首帧
	//------------------------------------------------------------------
	if(_tRecId->st.packetID == 0)  DataLen = 0;
	//------------------------------------------------------------------
	// 接收数据
	//------------------------------------------------------------------
	rt_memcpy((uint8_t*)(can._std_msg[frame].CanBuffData + _tRecId->st.packetID * 8),
		_p->data.Data,
		_p->data.DLC);
	//------------------------------------------------------------------
	// 统计收到帧长
	//------------------------------------------------------------------
	DataLen += _p->data.DLC;
	//------------------------------------------------------------------
	// 收到尾帧
	//------------------------------------------------------------------
	if(_tRecId->st.packetID == ((can._std_msg[frame].len - 1) / 8))
	{
		//----------------------------------------------------------------
		// 帧长正确,更新数据
		//----------------------------------------------------------------
		if(DataLen == can._std_msg[frame].len)
		{
			can._std_msg[frame].update = 1;
		}
		//----------------------------------------------------------------
		// 清0帧长
		//----------------------------------------------------------------
		DataLen = 0;
	}
}

/****************************************************************
* Function Name  : StdMsgPush_sch
* Description    : 发送数据帧
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::CycleMsgPush(void)
{
	uint32_t ExtId = 0;
	uint16_t frameLen = 0;
	uint8_t Sendlen = 0;
	uint8_t ScanFrame = 0; 
	uint8_t frameCnt = 0;
	uint8_t	lastFrameFlag = 0;
	static uint8_t _askS_sheet = 0;
	static uint8_t _askP_sheet = 0;
	//-----------------------------------------------------------------
	// 扫描端口信息
	//------------------------------------------------------------------
	for(ScanFrame = 0; ScanFrame < CAN_STD_FRAME_NUM; ScanFrame++)
	{
		if(_std_msg[ScanFrame].direction == CAN_TX_DIRC)
		{
			if(++_std_msg[ScanFrame].clock < _std_msg[ScanFrame].sendTick)
				continue;
			else _std_msg[ScanFrame].clock = 0;
			
			if(_std_msg[ScanFrame].CanBuffData == RT_NULL)
				continue;
			//-----------------------------------------------------------------
			// 轮询帧
			//------------------------------------------------------------------
			if(_std_msg[ScanFrame].FuncID == CAN_FUNC_S_POLL)
			{
				_askS_sheet++;
				_std_msg[ScanFrame].Dest = _askS_sheet;
				_askS_sheet = _askS_sheet % 5;
			}
			else if(_std_msg[ScanFrame].FuncID == CAN_FUNC_P_POLL)
			{
				_askP_sheet++;
				_std_msg[ScanFrame].Dest = _askP_sheet;
				_askP_sheet = _askP_sheet % 5;
			}
			//-----------------------------------------------------------------
			// 获取要发送端口数据长度
			//------------------------------------------------------------------
			frameLen = _std_msg[ScanFrame].len;
			//-----------------------------------------------------------------
			// 首帧帧编号
			//------------------------------------------------------------------
			frameCnt = 0;
			//-----------------------------------------------------------------
			// 拆包发送
			//------------------------------------------------------------------
			while (frameLen > 0)
			{
				//-----------------------------------------------------------
				// 计算本包数据长度
				//-----------------------------------------------------------
				if(frameLen > 8)
				{
					lastFrameFlag = 0;
					Sendlen = 8;
					frameLen -= 8;
				}
				else
				{
					lastFrameFlag = 1;
					Sendlen = frameLen;
					frameLen = 0;
				}

				ExtId = MakeCanMsgExtID(_std_msg[ScanFrame].direction,
					_std_msg[ScanFrame].FuncID,                           //功能号
					frameCnt,                                             //帧号
					_std_msg[ScanFrame].Dest,                             //宿端
					_std_msg[ScanFrame].Src,                              //源端
					lastFrameFlag);

				CanApp_MakeTxAckMsg(ExtId,					                   	//扩展ID
					Sendlen,                                              //发送数据字节长度
					&_std_msg[ScanFrame].CanBuffData[frameCnt*8],         //要发送数据
					&_tCyc);                                              //发送缓冲区

				can_send_buffer(_std_msg[ScanFrame].canPort , &_tCyc);

				//-----------------------------------------------------------------
				// 维护帧编号
				//------------------------------------------------------------------
				frameCnt++;
			}
		}
	}
}


/****************************************************************
* Function Name  : StdTriggerMsgPush_sch
* Description    : 发送数据帧
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::TriggerMsgPush(void)
{
	uint32_t ExtId = 0;
	uint16_t frameLen = 0;
	uint8_t Sendlen = 0;
	uint8_t ScanFrame = 0; 
	uint8_t frameCnt = 0;
	uint8_t	lastFrameFlag = 0;
	uint8_t i;
	static int iapSheet;
	static int index = 0;
	//-----------------------------------------------------------------
	// 扫描端口信息
	//------------------------------------------------------------------
	for(ScanFrame = 0; ScanFrame < CAN_STD_FRAME_NUM; ScanFrame++)
	{
		if(_std_msg[ScanFrame].direction == CAN_ZX_DIRC)
		{			
			if(_std_msg[ScanFrame].update  == 0)
				continue;

			_std_msg[ScanFrame].update = 0;

			if((_std_msg[ScanFrame].CanBuffData == RT_NULL) && (_std_msg[ScanFrame].len > 0))
				continue;
			//iap
			if (_std_msg[ScanFrame].FuncID == CAN_FUNC_IAP_INFO || _std_msg[ScanFrame].FuncID == CAN_FUNC_IAP_WRITE
			  ||_std_msg[ScanFrame].FuncID == CAN_FUNC_IAP_CHECK)
			{
				if (iapSheet == 0)
				{
					iapSheet = CanStateWord;
					index = 0;
				}
				for (i=0;i<8;i++)
				{
					if (iapSheet & (1 << i))
					{
						iapSheet = iapSheet >> (i+1);
						index += i + 1;
						_std_msg[ScanFrame].Dest = index;
						break;
					}
				}
				if (iapSheet > 0)
				{
					SendCan(ScanFrame);
				}
			}
			//-----------------------------------------------------------------
			// 获取要发送端口数据长度
			//------------------------------------------------------------------
			frameLen = _std_msg[ScanFrame].len;
			//-----------------------------------------------------------------
			// 首帧帧编号
			//------------------------------------------------------------------
			frameCnt = 0;
			//-----------------------------------------------------------------
			// 拆包发送
			//------------------------------------------------------------------
			while(frameLen > 0)
			{
				//-----------------------------------------------------------
				// 计算本包数据长度
				//-----------------------------------------------------------
				if(frameLen > 8)
				{
					lastFrameFlag = 0;
					Sendlen = 8;
					frameLen -= 8;
				}
				else
				{
					lastFrameFlag = 1;
					Sendlen = frameLen;
					frameLen = 0;
				}

				ExtId = MakeCanMsgExtID(_std_msg[ScanFrame].direction, //优先级
					_std_msg[ScanFrame].FuncID,                          //功能号
					frameCnt,                                            //帧号
					_std_msg[ScanFrame].Dest,                            //宿端
					_std_msg[ScanFrame].Src,
					lastFrameFlag);                             //源端

