ekrats/SC0X_Monitor/bsp/stm32f40x/userApp/canApp.cpp
				CanApp_MakeTxAckMsg(ExtId,						           //扩展ID
					Sendlen,                                       //发送数据字节长度
					&_std_msg[ScanFrame].CanBuffData[frameCnt*8],  //要发送数据
					&_tCyc);                                       //发送缓冲区

				can_send_buffer(_std_msg[ScanFrame].canPort , &_tCyc);

				//-----------------------------------------------------------------
				// 维护帧编号
				//------------------------------------------------------------------
				frameCnt++;
			}
		}
	}
}

/****************************************************************
* Function Name  : CanStateWord
* Description    : 接收数据帧
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::MsgRx_Manage(CAN_RX_DATA_RAM* pbuf, uint32_t _tId)
{
	CAN_RX_DATA_RAM *_p  = pbuf;
	PEXTID_UTYP _tRecStdId = (PEXTID_UTYP)&_tId;
	uint8_t ScanFrame = 0; 
	static int iapSheet = 0;

	if(_p->parent.CanPort == PORT1)
	{
		for(ScanFrame = 0; ScanFrame < CAN_STD_FRAME_NUM; ScanFrame++)
		{
			if((_std_msg[ScanFrame].direction == CAN_RX_DIRC) 
				&& (_std_msg[ScanFrame].canPort == _p->parent.CanPort)
				&& (_std_msg[ScanFrame].Src == _tRecStdId->st.sourceID)
				&& (_std_msg[ScanFrame].Dest == _tRecStdId->st.sinkID)
				&& (_std_msg[ScanFrame].FuncID == _tRecStdId->st.func))
			{
				if(_std_msg[ScanFrame].callback == RT_NULL)
					continue;
				
				_std_msg[ScanFrame].callback(_p, _tRecStdId, ScanFrame);
				
				if (can.CanCnt > 0)
				{
					can.CanCnt = 0;
				}
				
				if(_std_msg[ScanFrame].Src == CAN_ID_C1)
				{
					CanFltCnt[0] = 0;
				}
				
				if(_std_msg[ScanFrame].Src == CAN_ID_C2)
				{
					CanFltCnt[1] = 0;
				}
				
				if(_std_msg[ScanFrame].Src == CAN_ID_C3)
				{
					CanFltCnt[2] = 0;
				}

				if(_std_msg[ScanFrame].Src == CAN_ID_C4)
				{
					CanFltCnt[3] = 0;
				}
				
				if(_std_msg[ScanFrame].Src == CAN_ID_C5)
				{
					CanFltCnt[4] = 0;
				}

			}
			else if ((_tRecStdId->st.func == CAN_FUNC_IAP)
				&& (_std_msg[ScanFrame].FuncID == _tRecStdId->st.func))
			{
				if (CanStateWord & (1 << (_tRecStdId->st.sourceID - 1)))
				{
					iapSheet |= 1 << (_tRecStdId->st.sourceID - 1);
				}
				if (iapSheet == CanStateWord)
				{
					check_file_call_back(0x0);
					iapSheet = 0;
					sCan.canAppBuf.iap_index ++;
				}
				else if (_std_msg[ScanFrame].AppBuffData[0] != 0)
				{
					check_file_call_back(0x81);
				}
			}
		}
	}
	else
	{
		/*  do some warning*/
	}
}

/****************************************************************
* Function Name  : StdMsgUpdate_data_sch
* Description    : 更新发送接收数据
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::CycleMsgUpdate_data(void)
{
	uint8_t  ScanFrame = 0;
	//-----------------------------------------------------------------
	// 扫描端口信息
	//------------------------------------------------------------------
	for(ScanFrame = 0; ScanFrame < CAN_STD_FRAME_NUM; ScanFrame++)
	{
		if(_std_msg[ScanFrame].direction == CAN_RX_DIRC)
		{
			if(_std_msg[ScanFrame].update == 1)
			{
				memcpy(_std_msg[ScanFrame].AppBuffData, _std_msg[ScanFrame].CanBuffData, _std_msg[ScanFrame].len);
				_std_msg[ScanFrame].update = 0;
			}
		}
		else if(_std_msg[ScanFrame].direction == CAN_TX_DIRC)
		{				
			rt_memcpy(_std_msg[ScanFrame].CanBuffData, _std_msg[ScanFrame].AppBuffData, _std_msg[ScanFrame].len);
		}
	}
}

/****************************************************************
* Function Name  : StdTriggerMsgUpdate_data_sch
* Description    : 更新发送接收数据
*                   
* Input          : None
* Output         : None
* Return         : None
*****************************************************************/
void CanApp::TriggerMsgUpdate_data(uint8_t frame)
{
	//-----------------------------------------------------------------
	// 更新端口信息
	//------------------------------------------------------------------
	if(_std_msg[frame].direction == CAN_ZX_DIRC)
	{
		if((_std_msg[frame].CanBuffData != RT_NULL) && (_std_msg[frame].AppBuffData != RT_NULL))
		{
			rt_memcpy(_std_msg[frame].CanBuffData, _std_msg[frame].AppBuffData, _std_msg[frame].len);
		}
		_std_msg[frame].update = 1;
	}
}


/*******************************************************************************
* Function Name  : void CanApp_MakeTxAckMsg(uint32_t extID, uint8_t len, uint8_t* data, CanTxMsg* msg)
* Description    :
*                   
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void CanApp::CanApp_MakeTxAckMsg(uint32_t extID, uint8_t len, uint8_t* data, CanTxMsg* msg)
{
	if(len >= 8)
	{
		len = 8;
	}

	msg->ExtId   = extID;
	msg->IDE     = CAN_ID_EXT;
	msg->RTR     = 0;
	msg->DLC     = len;

	if((data != RT_NULL) && (len != 0))
	{
		msg->Data[0] = *data;
		msg->Data[1] = *(data + 1);
		msg->Data[2] = *(data + 2);
		msg->Data[3] = *(data + 3);
		msg->Data[4] = *(data + 4);
		msg->Data[5] = *(data + 5);
		msg->Data[6] = *(data + 6);
		msg->Data[7] = *(data + 7);
	}
}

/*******************************************************************************
* Function Name  : static uint32_t MakeCanStdMsgExtID(uint8_t priority, uint8_t func,  uint8_t frame,
uint8_t dest, uint8_t src, uint8_t checksum)
* Description    :
*                   
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
uint32_t CanApp::MakeCanMsgExtID(uint8_t classID, uint8_t func,  uint8_t frame,
								 uint8_t dest, uint8_t src, uint8_t last)
{
	EXTID_UTYP id;

	id.st.classID  = classID;
	id.st.packetID = frame;
	id.st.sourceID   = src;
	id.st.sinkID   = dest;
	id.st.func    = func;
	id.st.lastFrame = last;

	return (*(uint32_t*)&id & 0x1FFFFFFF);
}

void can_rx_interface(uint8_t port, CanRxMsg* msg)
{
	CAN_RX_DATA_RAM * rx_buffer = RT_NULL;
    uint8_t * tmp = msg->Data;
    
    if(tmp != RT_NULL)
    {
        rx_buffer = (CAN_RX_DATA_RAM *)rt_malloc(sizeof(CAN_RX_DATA_RAM));
        if(rx_buffer != RT_NULL)
        {
            rx_buffer->parent.CanPort = port;
			rx_buffer->data.StdId = msg->StdId;
			rx_buffer->data.ExtId = msg->ExtId;
			rx_buffer->data.IDE = msg->IDE;
			rx_buffer->data.RTR = msg->RTR;
			rx_buffer->data.DLC = msg->DLC;
            rx_buffer->data.Data[0] = tmp[0];
            rx_buffer->data.Data[1] = tmp[1];
            rx_buffer->data.Data[2] = tmp[2];
            rx_buffer->data.Data[3] = tmp[3];
            rx_buffer->data.Data[4] = tmp[4];
            rx_buffer->data.Data[5] = tmp[5];
            rx_buffer->data.Data[6] = tmp[6];
            rx_buffer->data.Data[7] = tmp[7];
            can.MsgRx_Manage(rx_buffer, msg->ExtId);
        }
		rt_free(rx_buffer);
    }
	
	can.CanCnt++;
	
